idaohang/stm32gps-sleep/Project/stm32gps/main.c
				                }
								DEBUG("g_uiSetSleepSec = %d\n", g_uiSetSleepSec);
				            }
				            else
				            {
				                DEBUG("Server Set Sleep Timer ERROR\n");
				            }
							break;
						}
						else
						{
#ifdef DBG_ENABLE_MACRO
		                STM_EVAL_LEDToggle(LED1);
		                DEBUG("GPRS_SendData LOGIN MSG Fail\n");
#endif // DBG_ENABLE_MACRO
						}
					}

#if 0					
					errNum = 0;
					g_usSequenceNum++;

					PackStationMsg();
#ifdef DBG_ENABLE_MACRO
ShowStationMsg();
#endif
					sendLen = 8+stStationInfo.num*11;
					while(errNum < 5)
					{
						errNum++;
						gprsRtn = GPRS_SendData(stationBuf, sendLen);
						if(USART_SUCESS == gprsRtn)
						{
							break;
						}
					}

#endif
					errNum = 0;
					g_usSequenceNum++;
					// detect remove action and alarm flag is setted then send alarm msg
					if((1 == alarmStickFlag)
                        && (SET == g_uiAlarmFlag))
	                {
	                    PackAlarmMsg();
	                    sendLen = EELINK_ALARM_MSGLEN;
						g_uiAlarmPacketFlag = SET;
						DEBUG("PackAlarmMsg\r\n");
	                }
	                else
	                {
	                    PackGpsMsg();
	                    sendLen = EELINK_GPS_MSGLEN;
						g_uiAlarmPacketFlag = RESET;
						DEBUG("PackGpsMsg\r\n");
	                }
ShowGpsMsg();
					while(errNum < 5)
					{
						errNum++;
						gprsRtn = GPRS_SendData(gpsBuf, sendLen);
						if(USART_SUCESS == gprsRtn)
						{
							gprsSendFlag = RST_OK;
							DEBUG("send_ok alarmflag = %d; g_alarmPacketFlag = %d\n", g_uiAlarmFlag, g_uiAlarmPacketFlag);
		                    // Toggle alarm flag
		                    if((SET == g_uiAlarmFlag) && (SET == g_uiAlarmPacketFlag))
		                    {
		                        g_uiAlarmFlag = RESET;
		                    }
		                    else
		                    {
		                        g_uiAlarmFlag = SET;
		                    }
		                    DEBUG("send_ok alarmflag = %d\n", g_uiAlarmFlag);
							break;
						}
					}
					errNum = 0;

					// break gprs send process
					if(RST_OK == gprsSendFlag)
					{
						break;
					}
				
				}
				gprsRetyTimes = 0;
				// break gprs send process
				if(RST_OK == gprsSendFlag)
				{
					break;
				}

			}
			gsmRetyTimes = 0;

        }

        /////////////////////////////////////////////////////////////////
        // This Process is Finished, Then goto sleep
        /////////////////////////////////////////////////////////////////

        /////////////////////////////////////////////////////////////////
        // Power OFF GPS and GSM before going into sleep mode
        /////////////////////////////////////////////////////////////////
        STM_EVAL_LEDOff(LED1);
        GPRS_CPOwd();
        GPSPowerOff();
        GSM_PowerOff();
		
        /* Wait till RTC Second event occurs */
        RTC_ClearFlag(RTC_FLAG_SEC);
        while(RTC_GetFlagStatus(RTC_FLAG_SEC) == RESET);

		// NOT Stick and Alarm Flag Valid, Then Sleep Less
		if(((uint32_t)Bit_SET == STM_EVAL_PBGetState(BUTTON_KEY))
                        && (SET == g_uiAlarmFlag))
		{
			RTC_SetAlarm(RTC_GetCounter() + SLEEP_ALARM_SEC);
			DEBUG("alarmmode sleep\n");
		}
		else
		{

        	RTC_SetAlarm(RTC_GetCounter() + g_uiSetSleepSec);
			DEBUG("normalmode sleep %d\n", g_uiSetSleepSec);
		}

        /* Wait until last write operation on RTC registers has finished */
        RTC_WaitForLastTask();
        DEBUG("GOING INTO STOPMODE %d sec\n", g_uiSetSleepSec);
        /* Request to enter STOP mode with regulator in low power mode*/
        PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

        /* Configures system clock after wake-up from STOP: enable HSE, PLL and select
           PLL as system clock source (HSE and PLL are disabled in STOP mode) */
        SYSCLKConfig_STOP();
    }

	// SHOULD NOT GO HAERE
	while(1)
	{
		STM_EVAL_LEDToggle(LED1);
		delay_10ms(50);
	}
}

/*********************************************************************************************************
 ** Function name:       ProcessIMEI()
 ** Descriptions:        将15个字节的IMEI字符串处理成8个字节的EELINK协议格式
 ** input parameters:    pImei 需要处理的15个字节的IMEI字符串
 **                      pRst 返回的字符串指针
 **                      imeilen IMEI字符串的长度
 **                      rstlen 返回的字符串的长度
 ** output parameters:
 ** Returned value:      成功RST_OK 失败RST_FAIL
 *********************************************************************************************************/
uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen)
{
    uint32_t i;
    if(((imeilen / 2 + 1) < rstlen) || (imeilen != 15))
    {
        return RST_FAIL;
    }

    *(pRst + 0) = (*(pImei + 0)) & 0x0F;
    for(i = (imeilen / 2); i > 0 ; i--)
    {
        *(pRst + i) = (((*(pImei + i * 2 - 1)) << 4) & 0xF0) + ((*(pImei + i * 2)) & 0x0F);
    }
    return RST_OK;
}

/**
  * @brief  Load IMEI to stLoginMsg structure
  * @param  None
  * @retval None
  */
void loadLoginMsg(uint8_t *imei, uint16_t sequence)
{
    stLoginMsg.hdr.header[0] = PROTO_EELINK_HEADER;
    stLoginMsg.hdr.header[1] = PROTO_EELINK_HEADER;
    stLoginMsg.hdr.type = PACKET_EELINK_LOGIN;
    stLoginMsg.hdr.len[0] = 0x00;
    stLoginMsg.hdr.len[1] = 0x0C;
    stLoginMsg.hdr.seq[0] = (uint8_t)((sequence >> 8) & 0x00FF);
    stLoginMsg.hdr.seq[1] = (uint8_t)((sequence) & 0x00FF);
    if(RST_FAIL == ProcessIMEI(imei, stLoginMsg.imei, IMEI_BUF_LEN, 8))
    {
        // re-init imei buffer
        memset(stLoginMsg.imei, sizeof(stLoginMsg.imei), 0);
        DEBUG("IMEI process ERROR!\n");
    }
    stLoginMsg.lang = EELINK_LANG; // english
    stLoginMsg.zone = EELINK_ZONE; // east 8
}

/**
  * @brief  Load stLoginMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackLoginMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        LoginBuf[offset] = stLoginMsg.hdr.header[i];
        offset++;
    }
    LoginBuf[offset] = stLoginMsg.hdr.type;
    offset++;
    for(i = 0; i < 2; i++)
    {
        LoginBuf[offset] = stLoginMsg.hdr.len[i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        LoginBuf[offset] = stLoginMsg.hdr.seq[i];
        offset++;
    }
    for(i = 0; i < 8; i++)
    {
        LoginBuf[offset] = stLoginMsg.imei[i];
        offset++;
    }
    LoginBuf[offset] = stLoginMsg.lang;
    offset++;
    LoginBuf[offset] = stLoginMsg.zone;
    offset++;
    if(offset != (EELINK_LOGIN_MSGLEN))
    {
        DEBUG("PackLoginMsg ERROR!\n");
    }
}


/**
  * @brief  Load gpsMsg structure to send buffer
  * @param  None
  * @retval None
  */
void PackGpsMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_GPS;
    offset++;
	gpsBuf[offset] = 0x00;
    offset++;
	gpsBuf[offset] = (EELINK_GPS_MSGLEN - 5); // 37
    offset++;
	gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
	gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
	offset++;
	// UTC日期时间
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.utc.s[3 - i];
        offset++;
    }
	// 纬度
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.latitude.s[3 - i];
        offset++;
    }
	// 经度
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.longitude.s[3 - i];
        offset++;
    }
	// 速度
    gpsBuf[offset] = stGPSData.speed;
    offset++;
	// 航向
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stGPSData.course.s[1 - i];
        offset++;
    }
	// 基站 9 bytes
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mcc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mnc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Lac[i];
        offset++;
    }
	gpsBuf[offset] = 0;  // 补零
    offset++;
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Ci[i];
        offset++;
    }
	// 定位状态
    gpsBuf[offset] = stGPSData.status;
    offset++;
	// 设备状态
	gpsBuf[offset] = 0x00;  // 补零
    offset++;
	gpsBuf[offset] = stGPSData.status;
    offset++;
	// 电池电压
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stBATInfo.BatVoltage.s[1 - i];
        offset++;
    }
	// 信号强度
	gpsBuf[offset] = 0;  // 补零
    offset++;
	gpsBuf[offset] = ucSignalQuality;
    offset++;
    // 模拟输入1
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_deviceData.analog1[i];
        offset++;
    }
	// 模拟输入2
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = g_deviceData.analog2[i];
        offset++;
    }

    if(offset != (EELINK_GPS_MSGLEN))
    {
        DEBUG("PackGpsMsg ERROR!\n");
    }
}

/**
  * @brief  Load gpsMsg structure to alarm send buffer
  * @param  None
  * @retval None
  */
void PackAlarmMsg(void)
{
    uint32_t i;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_EELINK_WARNING; //gpsMsg.hdr.type;
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (EELINK_ALARM_MSGLEN - 5); // header len
    offset++;
	gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
	gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
	offset++;
    
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.utc.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.latitude.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.longitude.s[3 - i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.speed;
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stGPSData.course.s[1 - i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mcc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mnc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Lac[i];
        offset++;
    }
	gpsBuf[offset] = 0;  // 补零
    offset++;
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Ci[i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.status;
    offset++;
    gpsBuf[offset] = 0x71;  // remove alarm flag
    offset++;

    if(offset != (EELINK_ALARM_MSGLEN))
    {
        DEBUG("PackAlarmMsg ERROR!\n");
    }
}

/**
  * @brief  Load station structure to station buffer
  * @param  None
  * @retval None
  */
void PackStationMsg(void)
{
    uint32_t i = 0;
	uint32_t j = 0;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        stationBuf[offset] = PROTO_EELINK_HEADER;
        offset++;
    }
    stationBuf[offset] = PACKET_EELINK_STATION; //gpsMsg.hdr.type;
    offset++;
    stationBuf[offset] = 0; // header len
    offset++;
    stationBuf[offset] = (3 + (stStationInfo.num*11)); // header len = 7+1+num*11-5
    offset++;
	stationBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
	stationBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
	offset++;

