idaohang/stm32gps-sleep/Project/stm32gps/main.c
	stationBuf[offset] = stStationInfo.num;
    offset++;
    
    for(i = 0; i < stStationInfo.num; i++)
    {
		for(j = 0; j < 2; j++)
		{
	        stationBuf[offset] = stStationInfo.stStation[i].mcc.s[1 - j];
	        offset++;
		}
		for(j = 0; j < 2; j++)
		{
	        stationBuf[offset] = stStationInfo.stStation[i].mnc.s[1 - j];
	        offset++;
		}
		for(j = 0; j < 2; j++)
		{
	        stationBuf[offset] = stStationInfo.stStation[i].lac.s[1 - j];
	        offset++;
		}
		for(j = 0; j < 3; j++)
		{
	        stationBuf[offset] = stStationInfo.stStation[i].ci.s[2 - j];
	        offset++;
		}
		stationBuf[offset] = stStationInfo.stStation[i].rxl;
	    offset++;
		stationBuf[offset] = stStationInfo.stStation[i].rxq;
	    offset++;
    }

    if(offset != (8+stStationInfo.num*11))
    {
        DEBUG("PackStationMsg ERROR!\n");
    }
}

/**
  * @brief  Load gpsMsg and stLoginMsg structure to factory send buffer
  * @param  None
  * @retval None
  */
void PackFactoryMsg(void)
{
    uint32_t i = 0;
    uint32_t offset = 0;
    offset = 0;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = PROTO_FACTORY_HEADER;
        offset++;
    }
    gpsBuf[offset] = PACKET_FACTORY_REPORT;  // header type
    offset++;
    gpsBuf[offset] = 0; // header len
    offset++;
    gpsBuf[offset] = (FACTORY_REPORT_MSGLEN - 5); // header len
    offset++;
    gpsBuf[offset] = (uint8_t)((g_usSequenceNum >> 8) & 0x00FF);
    offset++;
	gpsBuf[offset] = (uint8_t)((g_usSequenceNum) & 0x00FF);
	offset++;
	for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.utc.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.latitude.s[3 - i];
        offset++;
    }
    for(i = 0; i < 4; i++)
    {
        gpsBuf[offset] = stGPSData.longitude.s[3 - i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.speed;
    offset++;

    
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stGPSData.course.s[1 - i];
        offset++;
    }
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mcc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stIMSIInfo.Mnc[i];
        offset++;
    }
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Lac[i];
        offset++;
    }
	gpsBuf[offset] = 0;  // 补零
    offset++;
	for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stCREGInfo.Ci[i];
        offset++;
    }
    gpsBuf[offset] = stGPSData.status;
    offset++;
    gpsBuf[offset] = 0;  // device status
    offset++;
    gpsBuf[offset] = STM_EVAL_PBGetState(BUTTON_KEY);  // device status
    offset++;
    for(i = 0; i < 2; i++)
    {
        gpsBuf[offset] = stBATInfo.BatVoltage.s[1 - i];
        offset++;
    }

	gpsBuf[offset] = 0;  // 补零
    offset++;
	gpsBuf[offset] = ucSignalQuality; 
    offset++;
    for(i = 0; i < IMEI_BUF_LEN; i++)
    {
        gpsBuf[offset] = ucIMEIBuf[i];
        offset++;
    }

    for(i = 0; i < IMSI_INFO_LEN; i++)
    {
        gpsBuf[offset] = g_IMSIBuf[i];
        offset++;
    }
    for(i = 0; i < PHONE_NUMBER_LEN; i++)
    {
        gpsBuf[offset] = g_phoneNum[i];
        offset++;
    }
    gpsBuf[offset] = ucGPSStatus;  // gps status
    offset++;
    gpsBuf[offset] = 0x02;  // software version v2.0
    offset++;
    gpsBuf[offset] = 0x00;
    offset++;

    if(offset != (FACTORY_REPORT_MSGLEN))
    {
        DEBUG("PackFactoryMsg ERROR!\n");
    }
}

/**
 * @}
 */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
